#====================================================
#用于生成基本的图形变化矩阵的帮助器
#====================================================
#----------------------------------------------------

#===================================================
#函数名称：生成平移矩阵
#函数参数：dx，dy图像点需要平移的变化量
#函数返回：平移矩阵（齐次表达）
#===================================================
#----------------------------------------------------
GraphicTransferMatrixHelper_translation<-function(dx,dy)
{
  return (matrix(c(1,0,0,0,1,0,dx,dy,1),nrow=3,byrow=T));
}
#===================================================
#函数名称：生成旋转矩阵
#函数参数：angel图像点需要旋转的角度,Israd标示符，指定当前角度是否是弧度表示
#函数返回：旋转矩阵（齐次表达）
#===================================================
#----------------------------------------------------
GraphicTransferMatrixHelper_rotate<-function(angel,Israd=F)
{
  if(Israd=F) {angel<-(angel*180)/pi;}
  ca<-cos(angel);sa<-sin(angel);
  return (matrix(c(ca,-sa,0,sa,ca,0,0,0,1),nrow=3,byrow=T));
}
#===================================================
#函数名称：生成缩放矩阵
#函数参数：Sx，Sy图像点中x，y所需缩放的比例
#函数返回：旋转矩阵（齐次表达）
#===================================================
#----------------------------------------------------
GraphicTransferMatrixHelper_rotate<-function(Sx,Sy)
{
  return (matrix(c(Sx,0,0,0,Sy,0,0,0,1),nrow=3,byrow=T));
}